Repository: Ivo-Evans/earth-view-wallpaper
Catalog: locale/*/LC_MESSAGES/*.po
Languages: ar, it

source: Hide the indicator
ar: اخف المؤشر
it: Nascondi l'indicatore

source: Indicator brightness
ar: سطوع المؤشر
it: Luminosità dell'indicatore

source: Indicator
ar: المؤشر
it: Indicatore

source: Indicator icon
ar: رمز المؤشر
it: Icona dell'indicatore

source: Refresh interval
ar: حدث كل
it: Intervallo di aggiornamento

source: Change effective from next refresh
ar: التعديل سيكون فعال ابداءا من التحديث القادم
it: Le modifiche avranno effetto dal prossimo aggiornamento

source: Map Provider for external links
ar: منصة الخرائط للروابط الخارجية
it: Sito mappe per link esterni

source: Provider used to view wallpaper location and context
ar: المنصة المستخدمة لعرض موقع الصورة وسياقها
it: Sito usato per mostrare la localizzazione e il contesto della foto

source: Set background image
ar: ضبط كخلفية للشاشة
it: Imposta come sfondo

source: Set lock screen image
ar: ضبط كخلفية لواجهة الشاشة المقفلة
it: Imposta come schermata di blocco

source: Set lock screen password prompt image
ar: ضبط كخلفية لواجهة الشاشة المقفلة (صفحة ادخال الرقم السري)
it: Imposta come sfondo della schermata inserimento password per l'accesso

source: Download folder:
ar: مجلد التحميل:
it: Cartella di scaricamento:

source: Wallpaper pictures folder
ar: مجلد صور الخلفيات
it: Cartella delle immagini

source: Open download folder
ar: فتح مجلد التحميل
it: Apri cartella immagini

source: Delete previously downloaded wallpapers:
ar: حذف صور الخلفية المحملة سابقا:
it: Elimina sfondi precedentemente scaricati:

source: Background
ar: الخلفية
it: Sfondo

source: Changes since last version
ar: التعديلات عن النسخة الاخيرة
it: Modifiche dall'ultima versione

source: Change log
ar: سجل التغييرات
it: Modifiche

source: <span size="small">This program comes with ABSOLUTELY NO WARRANTY. See the <a href="https://www.gnu.org/licenses/old-licenses/gpl-2.0.html">GNU General Public License, version 3 or later</a> for details.</span>
ar: <span dir="rtl" size="small">يقدم هذا البرنامج دون أي ضمان على الإطلاق. راجع <a href="https://www.gnu.org/licenses/old-licenses/gpl-2.0.html">رخصة جنو العمومية ، الإصدار 3 أو أحدث</a> لمزيد من التفاصيل.</span>
it: <span size="small">Questo programma viene fornito ASSOLUTAMENTE SENZA GARANZIA. Vedi la <a href="https://www.gnu.org/licenses/old-licenses/gpl-2.0.html">Licenza Pubblica Generale GNU, versione 3 o successiva</a> per i dettagli.</span>

source: Based on NASA APOD Wallpaper extension by Elia Argentieri
ar: يرتكز علي NASA APOD Gnome shell extension ل Elia Argentieri
it: Basato su NASA APOD Wallpaper extension di Elia Argentieri

source: This GNOME shell extension sets your wallpaper to a random Google Earth photo from a selection of curated locations.
ar: هذا الامداد ل Gnome shell يقوم بضبط كخلفية بطريقة عشوائية صورة من Google Earth من ضمن قائمة مواقع جغرافية.
it: Questa estensione di Gnome shell imposta come sfondo, in modo casuale, una delle foto di Google Earth di una curata lista di luoghi.

source: Google Earth Wallpaper
ar: صور Google Earth
it: Sfondi di Google Earth

source: Maintained by Michael Carroll
ar: بتطوير Michael Carroll
it: Mantenuto da Michael Carroll

source: About
ar: عن
it: Informazioni

source: Bing Wallpaper pictures folder
ar: مجلد صور خلفيات Bing
it: Cartella sfondi Bing Wallpaper

source: <No refresh scheduled>
ar: <لا يوجد تحديث مجدول>
it: <Nessun aggiornamento pianificato>

source: Text Location
ar: مكان النص
it: Posizione testo

source: Geo Location
ar: مكان الموقع
it: Geolocalizzazione

source: External Link
ar: رابط خارجي
it: Link esterno

source: Copyright
ar: حقوق الملكية
it: Diritti d'autore

source: Set background image now
ar: ضبط كخلفية للشاشة الان
it: Imposta come sfondo ora

source: Set lockscreen image now
ar: ضبط كخلفية لواجهة الشاشة المقفلة الان
it: Imposta come sfondo schermata di blocco ora

source: Refresh Now
ar: حدث الآن
it: Aggiorna ora

source: Extension settings
ar: الإعدادات
it: Impostazioni estensione

source: Set lockscreen image
ar: ضبط كخلفية لواجهة الشاشة المقفلة
it: Imposta come sfondo schermata di blocco

source: On refresh:
ar: عند التحديث:
it: Al momento di aggiornamento:

source: Next refresh
ar: التحديث التالي
it: Prossimo aggiornamento

source: View in
ar: اعرض علي
it: Mostra su

source: Fetching...
ar: تحميل البيانات...
it: Scaricamento dati...

source: No wallpaper available
ar: ليست متاحة اي صور للخلفية
it: Nessuno sfondo disponibile

source: Something went wrong...
ar: حدث خطأ ما...
it: Qualcosa è andato storto...

source: 5 m
ar: 5 دقائق

source: 10 m
ar: 10 دقائق

source: 30 m
ar: 30 دقائق

source: 60 m
ar: 60 دقائق

source: 90 m
ar: 90 دقائق

source: daily
ar: يوميا
it: quotidianamente

source: minutes
ar: دقائق
it: minuti

source: days
ar: أيام
it: giorni

source: hours
ar: ساعات
it: ore

source: No change log found for this release
ar: لم نعثر علي قائمة لتعديلات هذا الاصدار
it: Nessuna lista delle modifiche trovata per questa versione
